year_tax = int(input())         #	Годишната такса за тренировки по баскетбол – цяло число
snickers = year_tax * 0.6       # •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
suit = snickers * 0.8           # •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
ball = suit / 4                 # •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
accessories = ball / 5          # •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
total = year_tax + snickers + suit + ball + accessories
print(f"{total:.2f}")